# NewInstanceId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDataInstanceAddedIntoDocumentEventArgs..::..NewInstanceId Property
ExternalDataInstanceAddedIntoDocumentEventArgs Class See Also
---
The newly added external data instance id.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ElementId NewInstanceId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NewInstanceId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ NewInstanceId {
	ElementId^ get ();
}
```

# See Also
ExternalDataInstanceAddedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace